; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v5 ?v4)
             (pred_7 ?v3 ?v8)
             (pred_3 ?v5 ?v8)
             (pred_8 ?v9 ?v5 )
	     (pred_1 ?v5)
             (pred_11 ?v11)
             (pred_10 ?v3)
             (pred_9 ?v8)
             (pred_6 ?v5)
             (pred_5 ?v3)
             (pred_12 ?v5)
             (pred_4 ))



(:action op_5
:parameters (?v13 ?v10 ?v7 ?v12)
:precondition (and (pred_11 ?v13) (pred_11 ?v10) (pred_10 ?v7) (pred_9 ?v12)
          (pred_2 ?v13 ?v10) (pred_7 ?v7 ?v12)
                   (pred_3 ?v10 ?v12) (pred_1 ?v13) 
                   (pred_6 ?v10) (pred_5 ?v7))
:effect (and  (pred_12 ?v10) (not (pred_6 ?v10))))


(:action op_4
:parameters (?v13 ?v1)
:precondition (and (pred_11 ?v13) (pred_11 ?v1)
               (pred_1 ?v13) (pred_2 ?v13 ?v1) (pred_12 ?v1))
:effect (and (pred_1 ?v1) (not (pred_1 ?v13))))

(:action op_3
:parameters (?v13 ?v7)
:precondition (and (pred_11 ?v13) (pred_10 ?v7) 
                  (pred_1 ?v13) (pred_8 ?v7 ?v13) (pred_4 ))
:effect (and (pred_5 ?v7)
   (not (pred_8 ?v7 ?v13)) (not (pred_4 ))))


(:action op_2
:parameters (?v13 ?v6 ?v2)
:precondition (and (pred_11 ?v13) (pred_10 ?v6) (pred_10 ?v2)
                  (pred_1 ?v13) (pred_5 ?v2) (pred_8 ?v6 ?v13))
:effect (and (pred_5 ?v6) (pred_8 ?v2 ?v13)
        (not (pred_5 ?v2)) (not (pred_8 ?v6 ?v13))))

(:action op_1
:parameters (?v13 ?v7)
:precondition (and (pred_11 ?v13) (pred_10 ?v7) 
                  (pred_1 ?v13) (pred_5 ?v7))
:effect (and (pred_4 ) (pred_8 ?v7 ?v13) (not (pred_5 ?v7)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_19 obj_26 obj_28 obj_12 obj_25 obj_02 obj_13 obj_23 obj_24 obj_07 obj_22 obj_09 obj_04 obj_01 obj_11 obj_18 obj_30 obj_08 obj_14 obj_17 obj_29 obj_03 obj_10 obj_16
    obj_06 obj_20
    obj_27 obj_21 obj_15
    )

    (:init
       (pred_4)

       (pred_11 obj_05)
       (pred_11 obj_19)
       (pred_11 obj_26)
       (pred_11 obj_28)
       (pred_11 obj_12)
       (pred_11 obj_25)
       (pred_11 obj_02)
       (pred_11 obj_13)
       (pred_11 obj_23)
       (pred_11 obj_24)
       (pred_11 obj_07)
       (pred_11 obj_22)
       (pred_11 obj_09)
       (pred_11 obj_04)
       (pred_11 obj_01)
       (pred_11 obj_11)
       (pred_11 obj_18)
       (pred_11 obj_30)
       (pred_11 obj_08)
       (pred_11 obj_14)
       (pred_11 obj_17)
       (pred_11 obj_29)
       (pred_11 obj_03)
       (pred_11 obj_10)
       (pred_11 obj_16)
       (pred_9 obj_06)
       (pred_9 obj_20)
       (pred_10 obj_27)
       (pred_10 obj_21)
       (pred_10 obj_15)

       (pred_2 obj_05 obj_25)
       (pred_2 obj_05 obj_19)
       (pred_2 obj_19 obj_02)
       (pred_2 obj_19 obj_26)
       (pred_2 obj_19 obj_05)
       (pred_2 obj_26 obj_13)
       (pred_2 obj_26 obj_28)
       (pred_2 obj_26 obj_19)
       (pred_2 obj_28 obj_23)
       (pred_2 obj_28 obj_12)
       (pred_2 obj_28 obj_26)
       (pred_2 obj_12 obj_24)
       (pred_2 obj_12 obj_28)
       (pred_2 obj_25 obj_07)
       (pred_2 obj_25 obj_02)
       (pred_2 obj_25 obj_05)
       (pred_2 obj_02 obj_22)
       (pred_2 obj_02 obj_13)
       (pred_2 obj_02 obj_19)
       (pred_2 obj_02 obj_25)
       (pred_2 obj_13 obj_09)
       (pred_2 obj_13 obj_23)
       (pred_2 obj_13 obj_26)
       (pred_2 obj_13 obj_02)
       (pred_2 obj_23 obj_04)
       (pred_2 obj_23 obj_24)
       (pred_2 obj_23 obj_28)
       (pred_2 obj_23 obj_13)
       (pred_2 obj_24 obj_01)
       (pred_2 obj_24 obj_12)
       (pred_2 obj_24 obj_23)
       (pred_2 obj_07 obj_11)
       (pred_2 obj_07 obj_22)
       (pred_2 obj_07 obj_25)
       (pred_2 obj_22 obj_18)
       (pred_2 obj_22 obj_09)
       (pred_2 obj_22 obj_02)
       (pred_2 obj_22 obj_07)
       (pred_2 obj_09 obj_30)
       (pred_2 obj_09 obj_04)
       (pred_2 obj_09 obj_13)
       (pred_2 obj_09 obj_22)
       (pred_2 obj_04 obj_08)
       (pred_2 obj_04 obj_01)
       (pred_2 obj_04 obj_23)
       (pred_2 obj_04 obj_09)
       (pred_2 obj_01 obj_14)
       (pred_2 obj_01 obj_24)
       (pred_2 obj_01 obj_04)
       (pred_2 obj_11 obj_17)
       (pred_2 obj_11 obj_18)
       (pred_2 obj_11 obj_07)
       (pred_2 obj_18 obj_29)
       (pred_2 obj_18 obj_30)
       (pred_2 obj_18 obj_22)
       (pred_2 obj_18 obj_11)
       (pred_2 obj_30 obj_03)
       (pred_2 obj_30 obj_08)
       (pred_2 obj_30 obj_09)
       (pred_2 obj_30 obj_18)
       (pred_2 obj_08 obj_10)
       (pred_2 obj_08 obj_14)
       (pred_2 obj_08 obj_04)
       (pred_2 obj_08 obj_30)
       (pred_2 obj_14 obj_16)
       (pred_2 obj_14 obj_01)
       (pred_2 obj_14 obj_08)
       (pred_2 obj_17 obj_29)
       (pred_2 obj_17 obj_11)
       (pred_2 obj_29 obj_03)
       (pred_2 obj_29 obj_18)
       (pred_2 obj_29 obj_17)
       (pred_2 obj_03 obj_10)
       (pred_2 obj_03 obj_30)
       (pred_2 obj_03 obj_29)
       (pred_2 obj_10 obj_16)
       (pred_2 obj_10 obj_08)
       (pred_2 obj_10 obj_03)
       (pred_2 obj_16 obj_14)
       (pred_2 obj_16 obj_10)
       (pred_6 obj_28)
       (pred_6 obj_25)
       (pred_6 obj_09)
       (pred_3  obj_28 obj_06)
       (pred_3  obj_25 obj_20)
       (pred_3  obj_09 obj_20)
       (pred_12 obj_05)
       (pred_12 obj_19)
       (pred_12 obj_26)
       (pred_12 obj_12)
       (pred_12 obj_02)
       (pred_12 obj_13)
       (pred_12 obj_23)
       (pred_12 obj_24)
       (pred_12 obj_07)
       (pred_12 obj_22)
       (pred_12 obj_04)
       (pred_12 obj_01)
       (pred_12 obj_11)
       (pred_12 obj_18)
       (pred_12 obj_30)
       (pred_12 obj_08)
       (pred_12 obj_14)
       (pred_12 obj_17)
       (pred_12 obj_29)
       (pred_12 obj_03)
       (pred_12 obj_10)
       (pred_12 obj_16)

       (pred_7  obj_27 obj_06)
       (pred_7  obj_21 obj_20)
       (pred_7  obj_15 obj_06)
       (pred_8 obj_27 obj_09)
       (pred_8 obj_21 obj_10)
       (pred_8 obj_15 obj_14)
       (pred_1 obj_29)
    )

    (:goal (and
       (pred_8 obj_15 obj_18)
    ))
(:constraints
  (always (not (pred_1 obj_08)))
)
)

; plan
1. (op_4 obj_29 obj_03)
   deleted: (pred_1 obj_29)
   added: (pred_1 obj_03)
   goals met: 0 of 1
2. (op_4 obj_03 obj_10)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_10)
   goals met: 0 of 1
3. (op_4 obj_10 obj_16)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_16)
   goals met: 0 of 1
4. (op_4 obj_16 obj_14)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_14)
   goals met: 0 of 1
5. (op_3 obj_14 obj_15)
   deleted: (pred_8 obj_15 obj_14) (pred_4)
   added: (pred_5 obj_15)
   goals met: 0 of 1
6. (op_4 obj_14 obj_16)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_16)
   goals met: 0 of 1
7. (op_4 obj_16 obj_10)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_10)
   goals met: 0 of 1
8. (op_4 obj_10 obj_03)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_03)
   goals met: 0 of 1
9. (op_4 obj_03 obj_30)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_30)
   goals met: 0 of 1
10. (op_4 obj_30 obj_18)
   deleted: (pred_1 obj_30)
   added: (pred_1 obj_18)
   goals met: 0 of 1
11. (op_1 obj_18 obj_15)
   deleted: (pred_5 obj_15)
   added: (pred_4) (pred_8 obj_15 obj_18)
   goals met: 1 of 1
